app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "password", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Juan"], ["password", "[FILTERED]"], ["email", "juanperez@gmail.com"], ["created_at", "2023-12-09 18:07:13.592636"], ["updated_at", "2023-12-09 18:07:13.592636"]]